app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"  ORDER BY subjects.position ASC
---
  def index
    @subjects = Subject.sorted      #Subject.order("position ASC")